# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# CFG file for YOLOv12-turbo

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov12n.yaml' will call yolov12.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512] 


# YOLO12-turbo backbone with Dual-Branch as Initial Downsampling
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]
  - [-1, 1, StandardBranch, [128, 3, 2]]
  - [-2, 1, DenoisingBranch, [128, 3, 2]]
  - [[-1, -2], 1, AdaptiveFeatureFusion, [1]]
  
  # ===== R-ELAN BLOCKS (standard, no attention) =====
  - [-1, 2, C3k2, [256, False, 0.25]] # 3-R-ELAN (P2)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 4-Downsampling to P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 5-R-ELAN (P3)
  - [-1, 1, Conv, [512, 3, 2]] # 6-Downsampling to P4/16
  - [-1, 2, A2C2f, [512, True, 4]] # 7-R-ELAN (P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 8-Downsampling to P5/32
  - [-1, 2, A2C2f, [1024, True, 1]] # 9-R-ELAN (P5)

# YOLO12-turbo head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)